pkg/wsman/wsmantesting/responses/cim/associatedpower/managementservice/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope" xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust" xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:g="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_AssociatedPowerManagementService" xmlns:h="http://schemas.dmtf.org/wbem/wscim/1/common" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <a:Header>
    <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
    <b:RelatesTo>0</b:RelatesTo>
    <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
    <b:MessageID>uuid:00000000-8086-8086-8086-000000007A93</b:MessageID>
    <c:ResourceURI>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_AssociatedPowerManagementService</c:ResourceURI>
  </a:Header>
  <a:Body>
    <g:CIM_AssociatedPowerManagementService>
      <g:AvailableRequestedPowerStates>10</g:AvailableRequestedPowerStates>
      <g:AvailableRequestedPowerStates>8</g:AvailableRequestedPowerStates>
      <g:AvailableRequestedPowerStates>5</g:AvailableRequestedPowerStates>
      <g:AvailableRequestedPowerStates>11</g:AvailableRequestedPowerStates>
      <g:AvailableRequestedPowerStates>4</g:AvailableRequestedPowerStates>
      <g:AvailableRequestedPowerStates>7</g:AvailableRequestedPowerStates>
      <g:AvailableRequestedPowerStates>14</g:AvailableRequestedPowerStates>
      <g:AvailableRequestedPowerStates>12</g:AvailableRequestedPowerStates>
      <g:PowerState>2</g:PowerState>
      <g:ServiceProvided>
        <b:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:Address>
        <b:ReferenceParameters>
          <c:ResourceURI>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_PowerManagementService</c:ResourceURI>
          <c:SelectorSet>
            <c:Selector Name="CreationClassName">CIM_PowerManagementService</c:Selector>
            <c:Selector Name="Name">Intel(r) AMT Power Management Service</c:Selector>
            <c:Selector Name="SystemCreationClassName">CIM_ComputerSystem</c:Selector>
            <c:Selector Name="SystemName">Intel(r) AMT</c:Selector>
          </c:SelectorSet>
        </b:ReferenceParameters>
      </g:ServiceProvided>
      <g:UserOfService>
        <b:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:Address>
        <b:ReferenceParameters>
          <c:ResourceURI>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_ComputerSystem</c:ResourceURI>
          <c:SelectorSet>
            <c:Selector Name="CreationClassName">CIM_ComputerSystem</c:Selector>
            <c:Selector Name="Name">ManagedSystem</c:Selector>
          </c:SelectorSet>
        </b:ReferenceParameters>
      </g:UserOfService>
    </g:CIM_AssociatedPowerManagementService>
  </a:Body>
</a:Envelope>
